SilenceLY05/STM32F103HAL/29-ADC采集/4.ADC—双重ADC-单通道-交替采集/User/ADC/bsp_adc.h
#ifndef __BSP_ADC_H__
#define __BSP_ADC_H__


#include "stm32f1xx.h"



extern DMA_HandleTypeDef hdma_adcx;
extern ADC_HandleTypeDef hadcx1;
extern ADC_HandleTypeDef hadcx2;


#define ADCx1_RCC_CLK_ENABLE()                  __HAL_RCC_ADC1_CLK_ENABLE()
#define ADCx1_RCC_CLK_DISABLE()                 __HAL_RCC_ADC1_CLK_DISABLE()
#define DMAx1_RCC_CLK_ENABLE()                  __HAL_RCC_DMA1_CLK_ENABLE()


//ADC  GPIO∫Í∂®“Â
#define ADC_GPIO_PORT                           GPIOC
#define ADC_GPIO_PIN                            GPIO_PIN_1
#define ADC_GPIO_CLK_ENABLE()                   __HAL_RCC_GPIOC_CLK_ENABLE()
#define ADC_CHANNEL                             ADC_CHANNEL_11

#define ADCx1                                   ADC1
#define ADC_DMAx_CHANNELn                       DMA1_Channel1
#define ADC_DMAx_CHANNELn_IRQn                  DMA1_Channel1_IRQn
#define ADC_DMAx_CHANNELn_IRQHANDLER            DMA1_Channel1_IRQHandler


#define ADCx2_RCC_CLK_ENABLE()                  __HAL_RCC_ADC2_CLK_ENABLE()
#define ADCx2_RCC_CLK_DISABLE()                 __HAL_RCC_ADC2_CLK_DISABLE()
#define ADCx2                                   ADC2



void ADCx_Init(void);

#endif /* __BSP_ADC_H__ */

